BitNibble/STM32G473VET6/STM32G473VET6_3/lib/src/stm32gxxx_i2c1.c
/************************************************************************
	STM32GXXX_I2C1
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License
Hardware: STM32G4
Date:     02/07/2026
************************************************************************/
#include "stm32gxxx_i2c1.h"

// Define standard tracking status identifiers matching I2C_ISR bit offsets
#define I2C_FLAG_TXIS  I2C_ISR_TXIS
#define I2C_FLAG_RXNE  I2C_ISR_RXNE
#define I2C_FLAG_TC    I2C_ISR_TC
#define I2C_FLAG_NACK  I2C_ISR_NACKF

/*** i2c1 PARAMETER ***/
static i2c1_par par_setup = { // DEFAULT
	.scl_gpio = GPIOA,    // Port A
	.sda_gpio = GPIOB,    // Port B
	.scl_af = 4U,
	.sda_af = 4U,
	.scl_pin = 15,            // SCL Pin 15
	.sda_pin = 9,             // SDA Pin 9
	.bus_speed = I2C_SPEED_STANDARD,
	.address_mode = I2C_ADDR_7BIT
};

/*** Procedure & Function Definition ***/
static void i2c1_clock_enable(void) {
	SET_BIT(dev()->sys->rcc->APB1ENR1,RCC_APB1ENR1_I2C1EN);
}
static void i2c1_clock_disable(void) {
	CLEAR_BIT(dev()->sys->rcc->APB1ENR1,RCC_APB1ENR1_I2C1EN);
}
//helper to handle configuration safety locks
static inline void _i2c1_modify_cr1_protected(void (*modify_func)(void)) {
    uint32_t is_enabled = GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos);
    if (is_enabled) {
        CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
        while(GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos));
    }
    modify_func();
    if (is_enabled) {
        SET_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
    }
}
// Universal non-blocking status check helper
static uint8_t _i2c1_get_flag(uint32_t flag_mask) {
    // Read the whole register and isolate the single flag bit
    return (dev()->comm->i2c1_bf->ISR.val & flag_mask) ? 1U : 0U;
}
// Fixed-timeout polling engine to protect your MCU from locking up indefinitely on bus faults
uint8_t _i2c1_wait_flag_timeout(uint32_t flag_mask, uint8_t status_expected, uint32_t timeout_loops) {
    volatile uint32_t timeout = timeout_loops;
    while (_i2c1_get_flag(flag_mask) != status_expected) {
        if (--timeout == 0) {
            return 0; // Operation failed / Timed out
        }
    }
    return 1; // Success
}
// Helper to safely read specific flags from the ISR status register
static uint8_t _i2c1_get_status_flag(uint32_t msk) {
	// Uses your get_field_value tool (Pos is 0 since we want the masked raw bit location)
	return GET_FIELD(dev()->comm->i2c1_bf->ISR.val, msk, 0) ? 1U : 0U;
}
// Fixed loop timeout polling engine to prevent the MCU from hanging on a dead bus
static uint8_t _i2c1_wait_status_flag(uint32_t msk, uint8_t expected_state, uint32_t timeout_loops) {
	volatile uint32_t timeout = timeout_loops;
	while (_i2c1_get_status_flag(msk) != expected_state) {
		if (--timeout == 0) {
			return 0; // Failed / Timed Out
		}
		// If a NACK occurs during transmission, abort early
		if (msk != I2C_ISR_NACKF && _i2c1_get_status_flag(I2C_ISR_NACKF)) {
			SET_BIT(dev()->comm->i2c1_bf->ICR.val, I2C_ICR_NACKCF); // Clear NACK flag
			return 0;
		}
	}
	return 1; // Success
}

/*******************  Bit definition for I2C_CR1 register  *******************/
uint8_t _i2c1_is_enabled(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_PE,I2C_CR1_PE_Pos);
}
static uint8_t _i2c1_is_disabled(void) {
	return !GET_FIELD(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_PE,I2C_CR1_PE_Pos);
}
static void i2c1_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_PE);
}
static void i2c1_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_PE);
}
static void i2c1_digital_filter(uint8_t filter) {
	uint32_t is_enabled = GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos);

	if (is_enabled) {
		CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
		while(GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos));
	}

	WRITE_FIELD(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_DNF,I2C_CR1_DNF_Pos,filter);

	if (is_enabled) {
		SET_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
	}
}
static void i2c1_analog_filter_enable(void) {
	uint32_t is_enabled = GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos);
	if (is_enabled) {
		CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
		while(GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos));
	}

	CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_ANFOFF);

	if (is_enabled) {
		SET_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
	}
}
static void i2c1_analog_filter_disable(void) {
	uint32_t is_enabled = GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos);

	if (is_enabled) {
		CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
		while(GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos));
	}

	SET_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_ANFOFF);

	if (is_enabled) {
		SET_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
	}
}
static void i2c1_software_reset(void) {
	SET_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_SWRST);
}
static void i2c1_clock_stretch_enable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_NOSTRETCH);
}
static void i2c1_clock_stretch_disable(void) {
	SET_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_NOSTRETCH);
}
static void i2c1_general_call_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_GCEN);
}
static void i2c1_general_call_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_GCEN);
}
static void i2c1_pec_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_PECEN);
}
static void i2c1_pec_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val,I2C_CR1_PECEN);
}

/******************  Bit definition for I2C_CR2 register  ********************/
void slave_address_direction(uint16_t device_ID, i2c_direction_t r_w) {
    // 1. Clear old address, direction, and execution flags
    CLEAR_BIT(I2C1->CR2, I2C_CR2_SADD | I2C_CR2_RD_WRN | I2C_CR2_START | I2C_CR2_STOP);

    // 2. Shift the 7-bit device address into bits [7:1] of SADD
    uint32_t address = (device_ID & 0x7FU) << 1;
    WRITE_FIELD(I2C1->CR2, I2C_CR2_SADD_Msk, I2C_CR2_SADD_Pos, address);

    // 3. Assign direction bit
    if (r_w == I2C_DIR_READ) {
        WRITE_FIELD(I2C1->CR2, I2C_CR2_RD_WRN_Msk, I2C_CR2_RD_WRN_Pos, I2C_DIR_READ);
    }
}

static void i2c1_addressing_mode(i2c_addr_mode_t mode) {
	if(mode == I2C_ADDR_10BIT)
		SET_BIT(I2C1->CR2, I2C_CR2_ADD10);
	else
		CLEAR_BIT(I2C1->CR2, I2C_CR2_ADD10);
}
static void i2c1_mode10_read_enable(void) {
	SET_BIT(I2C1->CR2, I2C_CR2_HEAD10R);
}
static void i2c1_mode10_read_disable(void) {
	CLEAR_BIT(I2C1->CR2, I2C_CR2_HEAD10R);
}
static void i2c1_nbytes(uint8_t nbytes) {
	WRITE_FIELD(I2C1->CR2, I2C_CR2_NBYTES, I2C_CR2_NBYTES_Pos, nbytes);
}
static void i2c1_reload_enable(void) {
	SET_BIT(I2C1->CR2, I2C_CR2_RELOAD);
}
static void i2c1_reload_disable(void) {
	CLEAR_BIT(I2C1->CR2, I2C_CR2_RELOAD);
}
static void i2c1_autoend_enable(void) {
	SET_BIT(I2C1->CR2, I2C_CR2_AUTOEND);
}
static void i2c1_autoend_disable(void) {
	CLEAR_BIT(I2C1->CR2, I2C_CR2_AUTOEND);
}
static void i2c1_pecbyte_enable(void) {
	SET_BIT(I2C1->CR2, I2C_CR2_PECBYTE);
}
static void i2c1_pecbyte_disable(void) {
	CLEAR_BIT(I2C1->CR2, I2C_CR2_PECBYTE);
}
static void i2c1_start(void) {
    // Safely assert only the START bit on top of your existing CR2 register layout
    SET_BIT(dev()->comm->i2c1_bf->CR2.val, I2C_CR2_START);
}

