BitNibble/STM32G473VET6/STM32G473VET6_3/lib/src/stm32gxxx_i2c1.c
static uint8_t i2c1_get_start(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->CR2.val, I2C_CR2_START, I2C_CR2_START_Pos);
}
void i2c1_stop_v1(void) {
	// STOP can be asserted directly to hardware safely to terminate/abort sequences
	SET_BIT(dev()->comm->i2c1_bf->CR2.val, I2C_CR2_STOP);
}
static void i2c1_stop(void) {
    SET_BIT(dev()->comm->i2c1_bf->CR2.val, I2C_CR2_STOP);
    // Wait for the stop condition to actually clear the bus safely
    while (!_i2c1_get_status_flag(I2C_ISR_STOPF));
    // Immediately clear the stop detection flag to leave a pristine state
    SET_BIT(dev()->comm->i2c1_bf->ICR.val, I2C_ICR_STOPCF);
}


/*******************  Bit definition for I2C_OAR1 register  ******************/
static void i2c1_own_address(uint8_t address) {
	WRITE_FIELD(dev()->comm->i2c1_bf->OAR1.val,I2C_OAR1_OA1,I2C_OAR1_OA1_Pos,address);
}
static void i2c1_own_address_10bit_mode_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->OAR1.val,I2C_OAR1_OA1MODE);
}
static void i2c1_own_address_10bit_mode_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->OAR1.val,I2C_OAR1_OA1MODE);
}
static void i2c1_own_address_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->OAR1.val,I2C_OAR1_OA1EN);
}
static void i2c1_own_address_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->OAR1.val,I2C_OAR1_OA1EN);
}
/*******************  Bit definition for I2C_TIMINGR register *******************/
static void i2c1_low_period(uint8_t ll) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SCLL,I2C_TIMINGR_SCLL_Pos,ll);
}
static void i2c1_high_period(uint8_t hh) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SCLH,I2C_TIMINGR_SCLH_Pos,hh);
}
static void i2c1_hold_timing(uint8_t hold) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SDADEL,I2C_TIMINGR_SDADEL_Pos,hold & 0xF);
}
static void i2c1_setup_timing(uint8_t setup) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SCLDEL,I2C_TIMINGR_SCLDEL_Pos,setup & 0xF);
}
static void i2c1_timing_prescaler(uint8_t prescaler) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_PRESC,I2C_TIMINGR_PRESC_Pos,prescaler & 0xF);
}
static uint8_t i2c1_get_low_period(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SCLL,I2C_TIMINGR_SCLL_Pos);
}
static uint8_t i2c1_get_high_period(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SCLH,I2C_TIMINGR_SCLH_Pos);
}
static uint8_t i2c1_get_hold_timing(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SDADEL,I2C_TIMINGR_SDADEL_Pos);
}
static uint8_t i2c1_get_setup_timing(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_SCLDEL,I2C_TIMINGR_SCLDEL_Pos);
}
static uint8_t i2c1_get_timing_prescaler(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->TIMINGR.val,I2C_TIMINGR_PRESC,I2C_TIMINGR_PRESC_Pos);
}

/******************* Bit definition for I2C_TIMEOUTR register *******************/
static void i2c1_bus_timeout(uint16_t timeout) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TIMEOUTR.val,I2C_TIMEOUTR_TIMEOUTA,I2C_TIMEOUTR_TIMEOUTA_Pos,timeout & 0x0FFF);
}
static void i2c1_idle_timeout_detect_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->TIMEOUTR.val,I2C_TIMEOUTR_TIDLE);
}
static void i2c1_idle_timeout_detect_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->TIMEOUTR.val,I2C_TIMEOUTR_TIDLE);
}
static void i2c1_timeout_enable(void) {
	SET_BIT(dev()->comm->i2c1_bf->TIMEOUTR.val,I2C_TIMEOUTR_TIMOUTEN);
}
static void i2c1_timeout_disable(void) {
	CLEAR_BIT(dev()->comm->i2c1_bf->TIMEOUTR.val,I2C_TIMEOUTR_TIMOUTEN);
}

/******************  Bit definition for I2C_ISR register  *********************/
static uint32_t i2c1_status(void) { // ACK NACK & ERROR FLAGS
	return dev()->comm->i2c1_bf->ISR.val;
}

/******************  Bit definition for I2C_PECR register  *********************/
static uint8_t i2c1_get_pecr(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->PECR.val,I2C_PECR_PEC,I2C_PECR_PEC_Pos);
}

/******************  Bit definition for I2C_RXDR register  *********************/
static uint8_t i2c1_get_rxdata(void) {
	return GET_FIELD(dev()->comm->i2c1_bf->RXDR.val,I2C_RXDR_RXDATA,I2C_RXDR_RXDATA_Pos);
}

/******************  Bit definition for I2C_TXDR register  *********************/
static void i2c1_set_txdata(uint8_t data) {
	WRITE_FIELD(dev()->comm->i2c1_bf->TXDR.val,I2C_TXDR_TXDATA,I2C_TXDR_TXDATA_Pos, data);
}

/*** Procedure & Function Definition ***/
static void i2c1_reset(void) {
	i2c1_disable();
	while(!_i2c1_is_disabled());
	i2c1_enable();
}

static uint8_t i2c1_is_idle(void) {
	uint32_t isr_value = dev()->comm->i2c1_bf->ISR.val;

	if ((isr_value & I2C_ISR_BUSY) == 0U) {
		return 1U;
	}

	return 0U;
}

uint8_t wait_for_bus_idle(uint32_t timeout_loops) {
	volatile uint32_t timeout = timeout_loops;

	while (i2c1_is_idle() == 0U) {
		if (--timeout == 0U) {
			i2c1()->run->reset();
			return 0U;
		}
	}
	return 1U;
}

static void i2c1_calculate_and_apply_timing(i2c_bus_speed_t target_bus_speed_hz) {
	uint32_t i2c_clk_hz = dev()->get->pclk1();

	// 1. Dynamic Prescaler derivation targeting an optimal internal timing clock.
	// For Standard Mode, we target 4MHz. For Fast Modes, we target 8MHz-16MHz for resolution.
	uint32_t target_internal_clk = (target_bus_speed_hz <= I2C_SPEED_STANDARD) ? 4000000UL : 10000000UL;
	uint32_t presc_val = i2c_clk_hz / target_internal_clk;

	if (presc_val > 0) presc_val -= 1UL;
	if (presc_val > 0x0FUL) presc_val = 0x0FUL; // Clamp to the hardware's 4-bit limit

	uint32_t prescaled_clk_hz = i2c_clk_hz / (presc_val + 1UL);

	// 2. Use signed variables for cycle derivation to capture low-frequency underflow risks
	int32_t total_cycles = (int32_t)(prescaled_clk_hz / (uint32_t)target_bus_speed_hz);

	// Adjust for inner hardware synchronization delay pipelines
	total_cycles -= 3;
	if (total_cycles < 4) total_cycles = 4; // Absolute minimum hardware safety floor

	int32_t scl_low = 0;
	int32_t scl_high = 0;
	uint8_t sdadel = 0;
	uint8_t scldel = 0;

	if (target_bus_speed_hz <= I2C_SPEED_STANDARD) {
		// Standard Mode (100 kHz)
		scl_low  = ((total_cycles * 50) / 100) - 1;
		scl_high = (total_cycles - (scl_low + 1)) - 1;
		sdadel   = 0x02U;
		scldel   = 0x04U;
	} else {
		// Fast Mode (400 kHz)
		scl_low  = ((total_cycles * 66) / 100) - 1;
		scl_high = (total_cycles - (scl_low + 1)) - 1;
		sdadel   = 0x01U;
		scldel   = 0x03U;
	}

	// 3. Prevent variable underflows from turning into maximum register limits (0xFF)
	if (scl_low  < 0) scl_low  = 0;
	if (scl_high < 0) scl_high = 0;
	if (scl_low  > 255) scl_low  = 255;
	if (scl_high > 255) scl_high = 255;

