BitNibble/STM32G473VET6/STM32G473VET6_3/lib/src/stm32gxxx_i2c1.c
	// 4. Combine the calculated fields into a single local tracking layout variable
	uint32_t timingr_value = 0;
	timingr_value |= (presc_val << I2C_TIMINGR_PRESC_Pos)  & I2C_TIMINGR_PRESC;
	timingr_value |= ((uint32_t)scl_low << I2C_TIMINGR_SCLL_Pos)   & I2C_TIMINGR_SCLL;
	timingr_value |= ((uint32_t)scl_high << I2C_TIMINGR_SCLH_Pos)  & I2C_TIMINGR_SCLH;
	timingr_value |= ((uint32_t)sdadel << I2C_TIMINGR_SDADEL_Pos) & I2C_TIMINGR_SDADEL;
	timingr_value |= ((uint32_t)scldel << I2C_TIMINGR_SCLDEL_Pos) & I2C_TIMINGR_SCLDEL;

	// 5. Commit using an atomic overwrite block while ensuring PE is disabled
	uint32_t is_enabled = GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos);
	if (is_enabled) {
		CLEAR_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
		while(GET_FIELD(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE, I2C_CR1_PE_Pos));
	}

	// Single atomic push using your structural layout tool
	WRITE_ENCODED(dev()->comm->i2c1_bf->TIMINGR.val, 0xFFFFFFFFU, timingr_value);

	if (is_enabled) {
		SET_BIT(dev()->comm->i2c1_bf->CR1.val, I2C_CR1_PE);
	}
}

static uint8_t i2c1_read_register(uint16_t device_id, uint8_t reg_addr, uint8_t* p_buffer, uint8_t length) {
	if (length == 0 || exe()->isPtrNull(p_buffer)) return 0;

	// Make sure AUTOEND is disabled in Phase 1 so we can issue a Repeated Start safely
	CLEAR_BIT(I2C1->CR2, I2C_CR2_AUTOEND);

	// Phase 1: Write the target register address (Atomic setup to prevent 1.5V glitches)
	slave_address_direction(device_id, I2C_DIR_WRITE);
	i2c1_nbytes(1);
	dev()->comm->i2c1_bf->ICR.val = (I2C_ICR_ALERTCF | I2C_ICR_TIMOUTCF | I2C_ICR_PECCF | I2C_ICR_OVRCF |
									I2C_ICR_ARLOCF | I2C_ICR_BERRCF | I2C_ICR_STOPCF | I2C_ICR_ADDRCF | I2C_ICR_NACKCF);
	i2c1_start();

	// Wait for TXIS with a software timeout counter (Atmel style protection)
	if (!_i2c1_wait_status_flag(I2C_ISR_TXIS, 1, 50000UL)) {
		i2c1_stop();
		return 0; // Safe abort if bus fails
	}
	i2c1_set_txdata(reg_addr);

	// Wait for Transfer Complete (TC) - Meaning address and register byte are completely out
	if (!_i2c1_wait_status_flag(I2C_ISR_TC, 1, 50000UL)) {
		i2c1_stop();
		return 0;
	}

	// =========================================================================
	// Phase 2: Atomic Repeated Start Update (Bypasses all STM32G4 register gaps)
	// =========================================================================
	uint32_t tmpreg = I2C1->CR2;

	// 1. Wipe out previous fields entirely to clear old NBYTES and Write mode tracking
	CLEAR_BIT(tmpreg, I2C_CR2_NBYTES | I2C_CR2_RD_WRN | I2C_CR2_START | I2C_CR2_STOP);

	// 2. Load the requested read length, device ID, Read direction, and auto-stop config
	SET_BIT(tmpreg, (uint32_t)length << I2C_CR2_NBYTES_Pos);
	SET_BIT(tmpreg, I2C_CR2_RD_WRN);
	SET_BIT(tmpreg, I2C_CR2_AUTOEND);
	SET_BIT(tmpreg, I2C_CR2_START);

	// 3. Commit all changes simultaneously in a single clock cycle
	I2C1->CR2 = tmpreg;
	// =========================================================================

	// Stream incoming data from the PCF8563 safely into your array
	for (uint8_t i = 0; i < length; i++) {
		// Drop out cleanly if the slave suddenly issues a NACK mid-transfer
		if (I2C1->ISR & I2C_ISR_NACKF) {
			I2C1->ICR = I2C_ICR_NACKCF;
			i2c1_stop();
			return 0;
		}

		if (!_i2c1_wait_status_flag(I2C_ISR_RXNE, 1, 50000UL)) {
			i2c1_stop();
			return 0; // Timeout exit if lines drop low
		}
		p_buffer[i] = i2c1_get_rxdata();
	}

	// Wait for the hardware to automatically assert the STOPF flag via AUTOEND
	if (!_i2c1_wait_status_flag(I2C_ISR_STOPF, 1, 50000UL)) {
		return 0;
	}

	I2C1->ICR = I2C_ICR_STOPCF; // Clear stop flag to leave bus ready
	return 1;
}

static uint8_t i2c1_write_register(uint16_t device_id, uint8_t reg_addr, uint8_t* p_data, uint8_t length) {
	if (length == 0 || exe()->isPtrNull(p_data)) return 0;

	// 1. Stage transaction parameters
	slave_address_direction(device_id, I2C_DIR_WRITE);

	// Total bytes = 1 byte for register address + payload length
	i2c1_nbytes(length + 1U);

	// Clear clearing/status flags before knocking on the wire
	SET_BIT(dev()->comm->i2c1_bf->ICR.val, 0x3F38U);

	// 2. Fire the hardware start sequence safely
	i2c1_start();

	// 3. Transmit the target internal register address first
	if (!_i2c1_wait_status_flag(I2C_ISR_TXIS, 1, 100000UL)) {
		i2c1_stop(); // Safe abort on timeout or NACK
		return 0;
	}
	i2c1_set_txdata(reg_addr);

	// 4. Stream out the remaining payload data sequentially
	for (uint8_t i = 0; i < length; i++) {
		if (!_i2c1_wait_status_flag(I2C_ISR_TXIS, 1, 100000UL)) {
			i2c1_stop();
			return 0;
		}
		i2c1_set_txdata(p_data[i]);
	}

	// 5. Wait for the standard Transfer Complete (TC) flag to wrap up
	if (!_i2c1_wait_status_flag(I2C_ISR_TC, 1, 100000UL)) {
		i2c1_stop();
		return 0;
	}

	// Terminate sequence and free the bus
	i2c1_stop();
	return 1;
}

static uint8_t i2c1_read_buffer(uint16_t device_id, uint8_t* p_buffer, uint8_t length) {
	if (length == 0 || exe()->isPtrNull(p_buffer)) return 0;
	// 1. Stage parameters
	slave_address_direction(device_id, I2C_DIR_READ);
	i2c1_nbytes(length);
	SET_BIT(dev()->comm->i2c1_bf->ICR.val, 0x3F38U);
	// 2. Fire Start
	i2c1_start();
	// 3. Stream data in sequentially
	for (uint8_t i = 0; i < length; i++) {
		// Wait for RXNE (Receive Not Empty) flag indicating data has arrived
		if (!_i2c1_wait_status_flag(I2C_ISR_RXNE, 1, 100000UL)) {
			return 0;
		}
		// Fetch the raw byte out of hardware
		p_buffer[i] = i2c1_get_rxdata();
	}
	return 1;
}

static uint8_t i2c1_write_buffer(uint16_t device_id, uint8_t* p_data, uint8_t length) {
	if (length == 0 || exe()->isPtrNull(p_data)) return 0;
	// 1. Stage the transaction parameters into your global shadow register
	slave_address_direction(device_id, I2C_DIR_WRITE);
	i2c1_nbytes(length);
	// 2. Clear out any leftover hardware status error flags before starting
	SET_BIT(dev()->comm->i2c1_bf->ICR.val, 0x3F38U);
	// 3. Fire the hardware start sequence!
	i2c1_start();
	// 4. Stream data out sequentially
	for (uint8_t i = 0; i < length; i++) {
		// Wait for TXIS (Transmit Interrupt Status) flag indicating TXDR is empty
		if (!_i2c1_wait_status_flag(I2C_ISR_TXIS, 1, 100000UL)) {
			i2c1_stop(); // Safe abort
			return 0;
		}
		// Load next data byte into the hardware transmitter
		i2c1_set_txdata(p_data[i]);
	}
	// 5. If AUTOEND is disabled, manually wait for Transfer Complete (TC) and stop
	// If AUTOEND is enabled, the hardware handles STOP automatically.
	return 1;
}

static void init(void) {
	/*** 1. ENABLE GPIO PERIPHERAL CLOCKS ***/
	// Turn on the peripheral clock gates for both Port A and Port B
	gpio()->clock( par_setup.scl_gpio, ONE );
	gpio()->clock( par_setup.sda_gpio, ONE );

