BitNibble/STM32G473VET6/STM32G473VET6_3/lib/src/stm32gxxx_i2c1.c
	/*** 2. SET PIN MODES TO ALTERNATE FUNCTION ***/
	// Route the internal I2C logic out to the physical pins
	gpio()->moder( GPIOA, par_setup.scl_pin, MODE_AF ); // SCL on PA15
	gpio()->moder( GPIOB, par_setup.sda_pin,  MODE_AF ); // SDA on PB9

	/*** 3. FORCE OPEN-DRAIN PIN DRIVERS (CRITICAL SAFETY STEP) ***/
	// Disconnect the high-side push-pull transistors so the pins can only pull LOW.
	// This prevents internal or external short-circuits.
	gpio()->otype(par_setup.scl_gpio, par_setup.scl_pin, ONE);
	gpio()->otype(par_setup.sda_gpio, par_setup.sda_pin, ONE);

	/*** 4. MAP TO ALTERNATE FUNCTION 4 (I2C1) ***/
	// Tell the internal pin matrix to explicitly hook PA15 and PB9 up to I2C1
	gpio()->af( par_setup.scl_gpio, par_setup.scl_pin, par_setup.scl_af ); // AF4 for SCL
	gpio()->af( par_setup.sda_gpio, par_setup.sda_pin, par_setup.sda_af ); // AF4 for SDA

	/*** 5. ENABLE WEAK INTERNAL PULL-UPS ***/
	// Keep the internal weak resistors active to assist your external 4.7k pull-ups
	gpio()->pupd( par_setup.scl_gpio, par_setup.scl_pin, GPIO_PULLUP );
	gpio()->pupd( par_setup.sda_gpio, par_setup.sda_pin,  GPIO_PULLUP );

	/*** 6. CONFIGURE HARDWARE DEFENSIVE TIMEOUTS (ATMEL-STYLE PROTECTION) ***/
	// Enable the STM32G4 Power peripheral clock to access system control registers
	dev()->sys->rcc->APB1ENR1 |= RCC_APB1ENR1_PWREN;

	// Turn on the I2C1 hardware timeout detector block.
	// If SCL or SDA are held low for more than ~25ms (due to a burned resistor or broken wire),
	// the hardware will automatically flag it, abort the freeze, and free your CPU.
	dev()->comm->i2c1->TIMEOUTR |= I2C_TIMEOUTR_TIMOUTEN;
	dev()->comm->i2c1->TIMEOUTR |= (0xA10U << I2C_TIMEOUTR_TIMEOUTA_Pos);

	/*** 7. INITIALIZE THE INTERNAL I2C SILICON BLOCK ***/
	i2c1_clock_enable();
	i2c1_digital_filter(1);
	i2c1_analog_filter_disable();
	i2c1_calculate_and_apply_timing(par_setup.bus_speed);
	i2c1_addressing_mode(par_setup.address_mode);
}

uint8_t test_v1(void){
	// Local buffer layout to track power-up responses safely
	uint8_t time_test_buffer[2] = {0};
	/*** Communication Wakeup ***/
	i2c1_enable();
	i2c1_autoend_enable(); // Enable auto-stop logic to support buffer transfers
	// Check if a hardware transaction is currently already running
	if(!i2c1_get_start()){
		if(i2c1_is_idle()){
			// Step 1: Tell PCF8563 we want to look at register address 0x02 (Seconds)
			uint8_t rtc_register_pointer = 0x02;

			if (i2c1_write_buffer(PCF8563, &rtc_register_pointer, 1U)) {
				// Step 2: Read the 2 raw active time bytes back securely
				if (i2c1_read_buffer(PCF8563, time_test_buffer, 2U)) {

					// 1. Extract raw seconds data and isolate it from the VL status bit
					uint8_t raw_seconds = time_test_buffer[0] & 0x7F;

					// 2. Decode the filtered BCD value into a standard decimal format
					uint8_t decimal_seconds = ((raw_seconds >> 4) * 10) + (raw_seconds & 0x0F);

					return decimal_seconds; // Safely returns 0 to 59

				}
			}
		}
	}
	return time_test_buffer[0];
}

static uint8_t test(void) {
	uint8_t time_test_buffer[2] = {0};

	i2c1_enable();

	// Ensure the physical bus is clear before knocking on the wire
	if (i2c1_is_idle()) {
		// Read 2 consecutive bytes starting directly at register 0x02 (Seconds, Minutes)
		if (i2c1_read_register(PCF8563, 0x02, time_test_buffer, 2U)) {
			// 1. Extract raw seconds data and isolate it from the VL status bit
			uint8_t raw_seconds = time_test_buffer[0] & 0x7F;

			// 2. Decode the filtered BCD value into a standard decimal format
			uint8_t decimal_seconds = ((raw_seconds >> 4) * 10) + (raw_seconds & 0x0F);

			return decimal_seconds; // Safely returns 0 to 59
		}
	}
	return time_test_buffer[0]; // Returns seconds byte
}

/*** i2c1 GET ***/
static i2c1_get get_setup = {
	.status = i2c1_status,
	.is_idle = i2c1_is_idle,
	.pecr = i2c1_get_pecr,
	.rxdata = i2c1_get_rxdata,
	.low_period = i2c1_get_low_period,
	.high_period = i2c1_get_high_period,
	.hold_timing = i2c1_get_hold_timing,
	.setup_timing = i2c1_get_setup_timing,
	.timing_prescaler = i2c1_get_timing_prescaler,
	.start = i2c1_get_start,
};
/*** i2c1 SET ***/
static i2c1_set set_setup = {
	.digital_filter = i2c1_digital_filter,
	.slave_address_direction = slave_address_direction,
	.addressing_mode = i2c1_addressing_mode,
	.nbytes = i2c1_nbytes,
	.own_address = i2c1_own_address,
	.low_period = i2c1_low_period,
	.high_period = i2c1_high_period,
	.hold_timing = i2c1_hold_timing,
	.setup_timing = i2c1_setup_timing,
	.timing_prescaler = i2c1_timing_prescaler,
	.bus_timeout = i2c1_bus_timeout,
	.txdata = i2c1_set_txdata,

	.reload_enable = i2c1_reload_enable,
	.reload_disable = i2c1_reload_disable,
	.autoend_enable = i2c1_autoend_enable,
	.autoend_disable = i2c1_autoend_disable,
	.pecbyte_enable = i2c1_pecbyte_enable,
	.pecbyte_disable = i2c1_pecbyte_disable,
};
/*** i2c1 V-TABLE ***/
static i2c1_run run_setup = {
	.init = init,
	.clock_enable = i2c1_clock_enable,
	.clock_disable = i2c1_clock_disable,
	.enable = i2c1_enable,
	.disable = i2c1_disable,
	.analog_filter_enable = i2c1_analog_filter_enable,
	.analog_filter_disable = i2c1_analog_filter_disable,
	.software_reset =  i2c1_software_reset,
	.clock_stretch_enable = i2c1_clock_stretch_enable,
	.clock_stretch_disable = i2c1_clock_stretch_disable,
	.general_call_enable = i2c1_general_call_enable,
	.general_call_disable = i2c1_general_call_disable,
	.pec_enable = i2c1_pec_enable,
	.pec_disable = i2c1_pec_disable,
	.mode10_read_enable = i2c1_mode10_read_enable,
	.mode10_read_disable = i2c1_mode10_read_disable,
	.reload_enable = i2c1_reload_enable,
	.reload_disable = i2c1_reload_disable,
	.autoend_enable = i2c1_autoend_enable,
	.autoend_disable = i2c1_autoend_disable,
	.pecbyte_enable = i2c1_pecbyte_enable,
	.pecbyte_disable = i2c1_pecbyte_disable,
	.start = i2c1_start,
	.stop = i2c1_stop,
	.own_address_10bit_mode_enable = i2c1_own_address_10bit_mode_enable,
	.own_address_10bit_mode_disable = i2c1_own_address_10bit_mode_disable,
	.own_address_enable = i2c1_own_address_enable,
	.own_address_disable = i2c1_own_address_disable,
	.idle_timeout_detect_enable = i2c1_idle_timeout_detect_enable,
	.idle_timeout_detect_disable = i2c1_idle_timeout_detect_disable,
	.timeout_enable = i2c1_timeout_enable,
	.timeout_disable = i2c1_timeout_disable,
	.reset = i2c1_reset,
	.wait_for_bus_idle = wait_for_bus_idle,
	.calculate_and_apply_timing = i2c1_calculate_and_apply_timing,
	.read_register = i2c1_read_register,
	.write_register = i2c1_write_register,
	.write_buffer = i2c1_write_buffer,
	.read_buffer = i2c1_read_buffer,
	.test = test,
};
/*** i2c1 CALLBACK ***/
static i2c1_irq irq_setup = {
	.ev_handler_callback = NULL,
	.er_handler_callback = NULL
};
/*** i2c1 HANDLER ***/
static i2c1_handler i2c1_setup = {
	.par = &par_setup,
	.get = &get_setup,
	.set = &set_setup,
	.irq = &irq_setup,
	.run = &run_setup
};
/*** i2c1 ACCESSOR FUNCTION ***/
i2c1_handler* i2c1(void){return &i2c1_setup;}

/*** EOF ***/

